"""
		Быстрая сортировка (на принципе разделяй и властвуй)

			Скорость работы алгоритма (зависит от выбора опорного элемента): 
				Лучший случай: O(log(n))
				Средний случай: O(n*log(n)) Прохождение по каждому(n) + разбиение на 2 ветви(log(n))
				Худший случай: O(n^2)
			
			Правило выбора опорного элемента:
				Выбирай СЛУЧАЙНЫЙ

			Константы в O-большом иногд амогут иметь занчение. 
			(Поэтому быстрая сортировка быстрее сортировки слиянием)

		Сортировка Слиянием: 
			Скорость работы : O(n*log(n))
"""

